logs/bench_run_v2.log
== Cleaning up any running vLLM servers ==

===== Qwen3.6-35B-A3B =====
[Qwen3.6-35B-A3B] starting server (Qwen/Qwen3.6-35B-A3B)
Started vLLM for 'Qwen3.6-35B-A3B' on port 8000 (pid=468846)
Logs: /home/igogo/.config/vllm-models/server.log
[Qwen3.6-35B-A3B] waiting for /health (up to 900s)...
[Qwen3.6-35B-A3B] ready, running benchmark
Warning: You are sending unauthenticated requests to the HF Hub. Please set a HF_TOKEN to enable higher rate limits and faster downloads.
Namespace(subparser='bench', bench_type='serve', dispatch_function=<function BenchmarkServingSubcommand.cmd at 0xe799a6402700>, trust_remote_code=False, seed=0, num_prompts=100, dataset_name='random', no_stream=False, dataset_path=None, no_oversample=False, skip_chat_template=False, enable_multimodal_chat=False, disable_shuffle=False, custom_output_len=256, spec_bench_output_len=256, spec_bench_category=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, blazedit_min_distance=0.0, blazedit_max_distance=1.0, asr_max_audio_len_sec=inf, asr_min_audio_len_sec=0.0, random_input_len=512, random_output_len=256, random_range_ratio=0.0, random_prefix_len=0, random_batch_size=1, no_reranker=False, random_mm_base_items_per_request=1, random_mm_num_mm_items_range_ratio=0.0, random_mm_limit_mm_per_prompt={'image': 255, 'video': 1}, random_mm_bucket_config={(256, 256, 1): 0.5, (720, 1280, 1): 0.5, (720, 1280, 16): 0.0}, hf_subset=None, hf_split=None, hf_name=None, hf_output_len=None, prefix_repetition_prefix_len=256, prefix_repetition_suffix_len=256, prefix_repetition_num_prefixes=10, prefix_repetition_output_len=128, label=None, backend='openai', base_url=None, host='127.0.0.1', port=8000, endpoint='/v1/completions', header=None, max_concurrency=None, model='Qwen/Qwen3.6-35B-A3B', input_len=None, output_len=None, tokenizer=None, tokenizer_mode='auto', use_beam_search=False, logprobs=None, request_rate=inf, burstiness=1.0, disable_tqdm=False, num_warmups=5, profile=False, save_result=True, save_detailed=False, append_result=False, metadata=None, result_dir='/home/igogo/.config/vllm-models/benchmarks', result_filename='bench_Qwen3.6-35B-A3B_20260418T095339Z.json', ignore_eos=False, percentile_metrics='ttft,tpot,itl,e2el', metric_percentiles='99', goodput=None, request_id_prefix='bench-27e90e2e-', top_p=None, top_k=None, min_p=None, temperature=None, frequency_penalty=None, presence_penalty=None, repetition_penalty=None, served_model_name=None, lora_modules=None, lora_assignment='random', ramp_up_strategy=None, ramp_up_start_rps=None, ramp_up_end_rps=None, ready_check_timeout_sec=0, extra_body=None, skip_tokenizer_init=False, insecure=False, plot_timeline=False, timeline_itl_thresholds=[25.0, 50.0], plot_dataset_stats=False)
INFO 04-18 11:59:05 [datasets.py:700] Sampling input_len from [512, 512] and output_len from [256, 256]
WARNING: vllm bench serve no longer sets temperature==0 (greedy) in requests by default. The default will be determined on the server side and can be model/API specific. For the old behavior, include --temperature=0.
Starting initial single prompt test run...
Skipping endpoint ready check.
Warming up with 5 requests...
100%|██████████| 5/5 [00:21<00:00,  4.31s/it]
Warmup run completed.
Starting main benchmark run...
Traffic request rate: inf
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: None
100%|██████████| 100/100 [01:35<00:00,  1.05it/s]
tip: install termplotlib and gnuplot to plot the metrics
============ Serving Benchmark Result ============
Successful requests:                     100       
Failed requests:                         0         
Benchmark duration (s):                  95.06     
Total input tokens:                      51200     
Total generated tokens:                  25600     
Request throughput (req/s):              1.05      
Output token throughput (tok/s):         269.30    
Peak output token throughput (tok/s):    400.00    
Peak concurrent requests:                100.00    
Total token throughput (tok/s):          807.89    
---------------Time to First Token----------------
Mean TTFT (ms):                          9089.08   
Median TTFT (ms):                        8682.44   
P99 TTFT (ms):                           17987.13  
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          327.95    
Median TPOT (ms):                        330.61    
P99 TPOT (ms):                           344.45    
---------------Inter-token Latency----------------
Mean ITL (ms):                           327.95    
Median ITL (ms):                         312.94    
P99 ITL (ms):                            774.35    
----------------End-to-end Latency----------------
Mean E2EL (ms):                          92716.87  
Median E2EL (ms):                        92987.93  
P99 E2EL (ms):                           95052.24  
==================================================
[Qwen3.6-35B-A3B] appended row to /home/igogo/.config/vllm-models/benchmarks/summary.csv
[Qwen3.6-35B-A3B] stopping server

===== gemma4-31b-it =====
[gemma4-31b-it] starting server (google/gemma-4-31B-it)
Started vLLM for 'gemma4-31b-it' on port 8000 (pid=472773)
Logs: /home/igogo/.config/vllm-models/server.log
[gemma4-31b-it] waiting for /health (up to 900s)...
[gemma4-31b-it] ready, running benchmark
Warning: You are sending unauthenticated requests to the HF Hub. Please set a HF_TOKEN to enable higher rate limits and faster downloads.
Namespace(subparser='bench', bench_type='serve', dispatch_function=<function BenchmarkServingSubcommand.cmd at 0xf5225b50e3e0>, trust_remote_code=False, seed=0, num_prompts=100, dataset_name='random', no_stream=False, dataset_path=None, no_oversample=False, skip_chat_template=False, enable_multimodal_chat=False, disable_shuffle=False, custom_output_len=256, spec_bench_output_len=256, spec_bench_category=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, blazedit_min_distance=0.0, blazedit_max_distance=1.0, asr_max_audio_len_sec=inf, asr_min_audio_len_sec=0.0, random_input_len=512, random_output_len=256, random_range_ratio=0.0, random_prefix_len=0, random_batch_size=1, no_reranker=False, random_mm_base_items_per_request=1, random_mm_num_mm_items_range_ratio=0.0, random_mm_limit_mm_per_prompt={'image': 255, 'video': 1}, random_mm_bucket_config={(256, 256, 1): 0.5, (720, 1280, 1): 0.5, (720, 1280, 16): 0.0}, hf_subset=None, hf_split=None, hf_name=None, hf_output_len=None, prefix_repetition_prefix_len=256, prefix_repetition_suffix_len=256, prefix_repetition_num_prefixes=10, prefix_repetition_output_len=128, label=None, backend='openai', base_url=None, host='127.0.0.1', port=8000, endpoint='/v1/completions', header=None, max_concurrency=None, model='google/gemma-4-31B-it', input_len=None, output_len=None, tokenizer=None, tokenizer_mode='auto', use_beam_search=False, logprobs=None, request_rate=inf, burstiness=1.0, disable_tqdm=False, num_warmups=5, profile=False, save_result=True, save_detailed=False, append_result=False, metadata=None, result_dir='/home/igogo/.config/vllm-models/benchmarks', result_filename='bench_gemma4-31b-it_20260418T100120Z.json', ignore_eos=False, percentile_metrics='ttft,tpot,itl,e2el', metric_percentiles='99', goodput=None, request_id_prefix='bench-30157792-', top_p=None, top_k=None, min_p=None, temperature=None, frequency_penalty=None, presence_penalty=None, repetition_penalty=None, served_model_name=None, lora_modules=None, lora_assignment='random', ramp_up_strategy=None, ramp_up_start_rps=None, ramp_up_end_rps=None, ready_check_timeout_sec=0, extra_body=None, skip_tokenizer_init=False, insecure=False, plot_timeline=False, timeline_itl_thresholds=[25.0, 50.0], plot_dataset_stats=False)
INFO 04-18 12:10:08 [datasets.py:700] Sampling input_len from [512, 512] and output_len from [256, 256]
WARNING: vllm bench serve no longer sets temperature==0 (greedy) in requests by default. The default will be determined on the server side and can be model/API specific. For the old behavior, include --temperature=0.
Starting initial single prompt test run...
Skipping endpoint ready check.
Warming up with 5 requests...
100%|██████████| 5/5 [01:14<00:00, 14.85s/it]
Warmup run completed.
Starting main benchmark run...
Traffic request rate: inf
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: None
100%|██████████| 100/100 [04:35<00:00,  2.76s/it]
tip: install termplotlib and gnuplot to plot the metrics
============ Serving Benchmark Result ============
Successful requests:                     100       
Failed requests:                         0         
Benchmark duration (s):                  275.89    
Total input tokens:                      51200     
Total generated tokens:                  25600     
Request throughput (req/s):              0.36      
Output token throughput (tok/s):         92.79     
Peak output token throughput (tok/s):    200.00    
Peak concurrent requests:                100.00    
Total token throughput (tok/s):          278.37    
---------------Time to First Token----------------
Mean TTFT (ms):                          25315.70  
Median TTFT (ms):                        24609.95  
P99 TTFT (ms):                           48097.86  
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          754.95    
Median TPOT (ms):                        746.15    
P99 TPOT (ms):                           885.96    
---------------Inter-token Latency----------------
Mean ITL (ms):                           754.95    
Median ITL (ms):                         637.16    
P99 ITL (ms):                            1961.77   
----------------End-to-end Latency----------------
Mean E2EL (ms):                          217828.22 
Median E2EL (ms):                        212349.30 
P99 E2EL (ms):                           274017.30 
==================================================
[gemma4-31b-it] appended row to /home/igogo/.config/vllm-models/benchmarks/summary.csv
[gemma4-31b-it] stopping server

===== glm47-flash =====
[glm47-flash] starting server (zai-org/GLM-4.7-Flash)
Started vLLM for 'glm47-flash' on port 8000 (pid=479186)
Logs: /home/igogo/.config/vllm-models/server.log
[glm47-flash] waiting for /health (up to 900s)...
[glm47-flash] ready, running benchmark
Warning: You are sending unauthenticated requests to the HF Hub. Please set a HF_TOKEN to enable higher rate limits and faster downloads.
Namespace(subparser='bench', bench_type='serve', dispatch_function=<function BenchmarkServingSubcommand.cmd at 0xe2dc58a8e3e0>, trust_remote_code=False, seed=0, num_prompts=100, dataset_name='random', no_stream=False, dataset_path=None, no_oversample=False, skip_chat_template=False, enable_multimodal_chat=False, disable_shuffle=False, custom_output_len=256, spec_bench_output_len=256, spec_bench_category=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, blazedit_min_distance=0.0, blazedit_max_distance=1.0, asr_max_audio_len_sec=inf, asr_min_audio_len_sec=0.0, random_input_len=512, random_output_len=256, random_range_ratio=0.0, random_prefix_len=0, random_batch_size=1, no_reranker=False, random_mm_base_items_per_request=1, random_mm_num_mm_items_range_ratio=0.0, random_mm_limit_mm_per_prompt={'image': 255, 'video': 1}, random_mm_bucket_config={(256, 256, 1): 0.5, (720, 1280, 1): 0.5, (720, 1280, 16): 0.0}, hf_subset=None, hf_split=None, hf_name=None, hf_output_len=None, prefix_repetition_prefix_len=256, prefix_repetition_suffix_len=256, prefix_repetition_num_prefixes=10, prefix_repetition_output_len=128, label=None, backend='openai', base_url=None, host='127.0.0.1', port=8000, endpoint='/v1/completions', header=None, max_concurrency=None, model='zai-org/GLM-4.7-Flash', input_len=None, output_len=None, tokenizer=None, tokenizer_mode='auto', use_beam_search=False, logprobs=None, request_rate=inf, burstiness=1.0, disable_tqdm=False, num_warmups=5, profile=False, save_result=True, save_detailed=False, append_result=False, metadata=None, result_dir='/home/igogo/.config/vllm-models/benchmarks', result_filename='bench_glm47-flash_20260418T101618Z.json', ignore_eos=False, percentile_metrics='ttft,tpot,itl,e2el', metric_percentiles='99', goodput=None, request_id_prefix='bench-0074252b-', top_p=None, top_k=None, min_p=None, temperature=None, frequency_penalty=None, presence_penalty=None, repetition_penalty=None, served_model_name=None, lora_modules=None, lora_assignment='random', ramp_up_strategy=None, ramp_up_start_rps=None, ramp_up_end_rps=None, ready_check_timeout_sec=0, extra_body=None, skip_tokenizer_init=False, insecure=False, plot_timeline=False, timeline_itl_thresholds=[25.0, 50.0], plot_dataset_stats=False)
INFO 04-18 12:20:32 [datasets.py:700] Sampling input_len from [512, 512] and output_len from [256, 256]
WARNING: vllm bench serve no longer sets temperature==0 (greedy) in requests by default. The default will be determined on the server side and can be model/API specific. For the old behavior, include --temperature=0.
Starting initial single prompt test run...
Skipping endpoint ready check.
Warming up with 5 requests...
100%|██████████| 5/5 [00:24<00:00,  4.92s/it]
Warmup run completed.
Starting main benchmark run...
Traffic request rate: inf
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: None
100%|██████████| 100/100 [01:25<00:00,  1.17it/s]
tip: install termplotlib and gnuplot to plot the metrics
============ Serving Benchmark Result ============
Successful requests:                     100       
Failed requests:                         0         
Benchmark duration (s):                  85.80     
Total input tokens:                      51200     
Total generated tokens:                  25600     
Request throughput (req/s):              1.17      
Output token throughput (tok/s):         298.36    
Peak output token throughput (tok/s):    400.00    
Peak concurrent requests:                100.00    
Total token throughput (tok/s):          895.07    
---------------Time to First Token----------------
Mean TTFT (ms):                          7167.44   
Median TTFT (ms):                        7233.46   
P99 TTFT (ms):                           13373.74  
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          298.50    
Median TPOT (ms):                        299.07    
P99 TPOT (ms):                           311.58    
---------------Inter-token Latency----------------
Mean ITL (ms):                           298.50    
Median ITL (ms):                         292.62    
P99 ITL (ms):                            534.74    
----------------End-to-end Latency----------------
Mean E2EL (ms):                          83283.88  
Median E2EL (ms):                        83496.80  
P99 E2EL (ms):                           85766.54  
==================================================
[glm47-flash] appended row to /home/igogo/.config/vllm-models/benchmarks/summary.csv
[glm47-flash] stopping server

===== qwen35-coder-35b =====
[qwen35-coder-35b] starting server (Qwen/Qwen3.5-35B-A3B)
Started vLLM for 'qwen35-coder-35b' on port 8000 (pid=482054)
Logs: /home/igogo/.config/vllm-models/server.log
[qwen35-coder-35b] waiting for /health (up to 900s)...
[qwen35-coder-35b] ready, running benchmark
Warning: You are sending unauthenticated requests to the HF Hub. Please set a HF_TOKEN to enable higher rate limits and faster downloads.
Namespace(subparser='bench', bench_type='serve', dispatch_function=<function BenchmarkServingSubcommand.cmd at 0xf961a100e3e0>, trust_remote_code=False, seed=0, num_prompts=100, dataset_name='random', no_stream=False, dataset_path=None, no_oversample=False, skip_chat_template=False, enable_multimodal_chat=False, disable_shuffle=False, custom_output_len=256, spec_bench_output_len=256, spec_bench_category=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, blazedit_min_distance=0.0, blazedit_max_distance=1.0, asr_max_audio_len_sec=inf, asr_min_audio_len_sec=0.0, random_input_len=512, random_output_len=256, random_range_ratio=0.0, random_prefix_len=0, random_batch_size=1, no_reranker=False, random_mm_base_items_per_request=1, random_mm_num_mm_items_range_ratio=0.0, random_mm_limit_mm_per_prompt={'image': 255, 'video': 1}, random_mm_bucket_config={(256, 256, 1): 0.5, (720, 1280, 1): 0.5, (720, 1280, 16): 0.0}, hf_subset=None, hf_split=None, hf_name=None, hf_output_len=None, prefix_repetition_prefix_len=256, prefix_repetition_suffix_len=256, prefix_repetition_num_prefixes=10, prefix_repetition_output_len=128, label=None, backend='openai', base_url=None, host='127.0.0.1', port=8000, endpoint='/v1/completions', header=None, max_concurrency=None, model='Qwen/Qwen3.5-35B-A3B', input_len=None, output_len=None, tokenizer=None, tokenizer_mode='auto', use_beam_search=False, logprobs=None, request_rate=inf, burstiness=1.0, disable_tqdm=False, num_warmups=5, profile=False, save_result=True, save_detailed=False, append_result=False, metadata=None, result_dir='/home/igogo/.config/vllm-models/benchmarks', result_filename='bench_qwen35-coder-35b_20260418T102233Z.json', ignore_eos=False, percentile_metrics='ttft,tpot,itl,e2el', metric_percentiles='99', goodput=None, request_id_prefix='bench-7bae0c52-', top_p=None, top_k=None, min_p=None, temperature=None, frequency_penalty=None, presence_penalty=None, repetition_penalty=None, served_model_name=None, lora_modules=None, lora_assignment='random', ramp_up_strategy=None, ramp_up_start_rps=None, ramp_up_end_rps=None, ready_check_timeout_sec=0, extra_body=None, skip_tokenizer_init=False, insecure=False, plot_timeline=False, timeline_itl_thresholds=[25.0, 50.0], plot_dataset_stats=False)
INFO 04-18 12:25:44 [datasets.py:700] Sampling input_len from [512, 512] and output_len from [256, 256]
WARNING: vllm bench serve no longer sets temperature==0 (greedy) in requests by default. The default will be determined on the server side and can be model/API specific. For the old behavior, include --temperature=0.
Starting initial single prompt test run...
Skipping endpoint ready check.
Warming up with 5 requests...
100%|██████████| 5/5 [00:19<00:00,  3.88s/it]
Warmup run completed.
Starting main benchmark run...
Traffic request rate: inf
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: None
100%|██████████| 100/100 [01:31<00:00,  1.09it/s]
tip: install termplotlib and gnuplot to plot the metrics
============ Serving Benchmark Result ============
Successful requests:                     100       
Failed requests:                         0         
Benchmark duration (s):                  91.45     
Total input tokens:                      51200     
Total generated tokens:                  25600     
Request throughput (req/s):              1.09      
Output token throughput (tok/s):         279.92    
Peak output token throughput (tok/s):    400.00    
Peak concurrent requests:                100.00    
Total token throughput (tok/s):          839.76    
---------------Time to First Token----------------
Mean TTFT (ms):                          8423.97   
Median TTFT (ms):                        7971.85   
P99 TTFT (ms):                           16970.58  
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          317.02    
Median TPOT (ms):                        319.64    
P99 TPOT (ms):                           334.94    
---------------Inter-token Latency----------------
Mean ITL (ms):                           317.02    
Median ITL (ms):                         302.62    
P99 ITL (ms):                            782.18    
----------------End-to-end Latency----------------
Mean E2EL (ms):                          89264.19  
Median E2EL (ms):                        89481.67  
P99 E2EL (ms):                           91441.85  
==================================================
[qwen35-coder-35b] appended row to /home/igogo/.config/vllm-models/benchmarks/summary.csv
[qwen35-coder-35b] stopping server

== Summary ==
timestamp           model               repo                     num_prompts  input_len  output_len  request_rate  request_throughput_rps  output_throughput_tps  total_token_throughput_tps  mean_ttft_ms          median_ttft_ms        p99_ttft_ms           mean_tpot_ms          median_tpot_ms        p99_tpot_ms           mean_itl_ms           result_file
"20260417T172101Z"  "Qwen3.6-35B-A3B"   "Qwen/Qwen3.6-35B-A3B"   "100"        "512"      "256"       "inf"         "0.8597414520905952"    "220.09381173519236"   "660.281435205577"          "30830.892162589807"  "30386.43694250277"   "39963.09982879022"   "326.19611931407906"  "328.7108440803993"   "342.9158551147954"   "326.1961198003538"   "bench_Qwen3.6-35B-A3B_20260417T172101Z.json"
"20260417T172910Z"  "gemma4-31b-it"     "google/gemma-4-31B-it"  "100"        "512"      "256"       "inf"         "0.3522445425080758"    "90.1746028820674"     "270.5238086462022"         "29714.027764420098"  "29054.667968499416"  "52640.29057491891"   "761.2169063819998"   "749.1272469372608"   "899.4582329640783"   "761.216906821216"    "bench_gemma4-31b-it_20260417T172910Z.json"
"20260417T174247Z"  "glm47-flash"       "zai-org/GLM-4.7-Flash"  "100"        "512"      "256"       "inf"         "1.0510179190856714"    "269.0605872859319"    "807.1817618577957"         "16142.003325169426"  "16402.69893200093"   "23534.104957253076"  "300.29468925553203"  "299.9312513215723"   "347.4589718226885"   "300.2946898810978"   "bench_glm47-flash_20260417T174247Z.json"
"20260417T174844Z"  "qwen35-coder-35b"  "Qwen/Qwen3.5-35B-A3B"   "100"        "512"      "256"       "inf"         "1.0484691082806807"    "268.40809171985427"   "805.2242751595628"         "10424.182973259522"  "9971.014730996103"   "19531.91070513909"   "324.1466447106285"   "326.8458469529458"   "341.3848388686718"   "324.1466450086665"   "bench_qwen35-coder-35b_20260417T174844Z.json"
"20260418T095339Z"  "Qwen3.6-35B-A3B"   "Qwen/Qwen3.6-35B-A3B"   "100"        "512"      "256"       "inf"         "1.0519403428799916"    "269.29672777727785"   "807.8901833318336"         "9089.080614928971"   "8682.435761504166"   "17987.130171525205"  "327.952103305882"    "330.6107500804002"   "344.44515839531533"  "327.95210366729276"  "bench_Qwen3.6-35B-A3B_20260418T095339Z.json"
"20260418T100120Z"  "gemma4-31b-it"     "google/gemma-4-31B-it"  "100"        "512"      "256"       "inf"         "0.3624658531011108"    "92.79125839388436"    "278.37377518165306"        "25315.695808839082"  "24609.946961492824"  "48097.86050558512"   "754.9510939813736"   "746.1548194921502"   "885.9646161959704"   "754.9510942336078"   "bench_gemma4-31b-it_20260418T100120Z.json"
"20260418T101618Z"  "glm47-flash"       "zai-org/GLM-4.7-Flash"  "100"        "512"      "256"       "inf"         "1.165452953850296"     "298.3559561856758"    "895.0678685570274"         "7167.438694059238"   "7233.461725991219"   "13373.74351499224"   "298.495857126669"    "299.0719657431541"   "311.5830528111352"   "298.4958575351412"   "bench_glm47-flash_20260418T101618Z.json"
"20260418T102233Z"  "qwen35-coder-35b"  "Qwen/Qwen3.5-35B-A3B"   "100"        "512"      "256"       "inf"         "1.0934435905353626"    "279.9215591770528"    "839.7646775311584"         "8423.973681920324"   "7971.854755502136"   "16970.583616830554"  "317.0204661916474"   "319.64408935492236"  "334.94112076543615"  "317.0204667600783"   "bench_qwen35-coder-35b_20260418T102233Z.json"

Raw JSONs: /home/igogo/.config/vllm-models/benchmarks
CSV:       /home/igogo/.config/vllm-models/benchmarks/summary.csv